{
  "Alazare Shiferaw": "Alazare Shiferaw",
  "General Manager": "Directeur général",
  "Mobile Number": "Numéro de portable",
  "Email": "Email",
  "We aim to lead East Africa in tech-driven engineering and education": "Nous visons à être les leaders en ingénierie et éducation technologique en Afrique de l'Est",
  "Custom Card": "Carte personnalisée",
  "Custom Phone Card": "Carte téléphonique personnalisée",
  "A modern and professional digital business card designed to make a lasting impression. Easily share your contact info, links, and social profiles with a sleek, interactive interface, accessible anytime, anywhere.": "Une carte de visite numérique moderne et professionnelle conçue pour faire une impression durable. Partagez facilement vos coordonnées, liens et profils sociaux via une interface élégante et interactive, accessible à tout moment, n'importe où.",
  "A compact, phone-backed digital business card designed for any professional. Instantly share your contact info, social links, or business profile,no apps, no paper, just seamless connection.": "Une carte de visite numérique compacte, basée sur le téléphone, conçue pour tout professionnel. Partagez instantanément vos coordonnées, liens sociaux ou profil d'entreprise, sans applications, sans papier, juste une connexion fluide.",
  "Products": "Produits",
  "Proceed to Payment": "Passer au paiement",
  "Total Amount": "Montant total",
  "Services": "Services",
  "Branding": "Branding",
  "Printing and related work": "Impression et travaux connexes",
  "Web Designing": "Conception web",
  "Select Time Slot": "Sélectionnez un créneau horaire",
  "Make An Appointment": "Prendre rendez-vous",
  "Date": "Date",
  "Testimonials": "Témoignages",
  "Amanuel S.": "Amanuel S.",
  "S.E.E.D has built an efficient, user-friendly, and reliable website that helped us build a digital brand and enhance our visibility.": "S.E.E.D a créé un site web efficace, convivial et fiable qui nous a aidés à construire une marque digitale et à améliorer notre visibilité.",
  "They listened carefully to our needs and delivered beyond expectations with their innovative approach to design and functionality.": "Ils ont écouté attentivement nos besoins et ont dépassé nos attentes grâce à leur approche innovante du design et de la fonctionnalité.",
  "Hanna T.": "Hanna T.",
  "Share Using QR Code": "Partager via code QR",
  "Share My QR Code": "Partager mon code QR",
  "Payment": "Paiement",
  "Choose your payment method": "Choisissez votre méthode de paiement",
  "TeleBirr": "TeleBirr",
  "CBE Birr": "CBE Birr",
  "Abyssinia": "Abyssinia",
  "Awash": "Awash",
  "Bank Number": "Numéro de banque",
  "Copied": "Copié",
  "Powered by": "Réalisé par",
  "Our Partners": "Nos partenaires",
  "Get Notified": "Recevez une notification",
  "Share": "Partager",
  "Register": "S'inscrire",
  "Add to Contacts": "Ajouter aux contacts",
  "copyright": "© 2025 | Propulsé par S.E.E.D"
}

