
{
  "Alazare Shiferaw": "علزار شيفيرا",
  "General Manager": "المدير العام",
  "Mobile Number": "رقم الهاتف المحمول",
  "Email": "البريد الإلكتروني",
  "We aim to lead East Africa in tech-driven engineering and education": "نهدف إلى قيادة شرق إفريقيا في الهندسة والتعليم المدفوعين بالتكنولوجيا",
  "Custom Card": "بطاقة مخصصة",
  "Custom Phone Card": "بطاقة هاتف مخصصة",
  "A modern and professional digital business card designed to make a lasting impression. Easily share your contact info, links, and social profiles with a sleek, interactive interface, accessible anytime, anywhere.": "بطاقة عمل رقمية حديثة ومهنية مصممة لترك انطباع دائم. شارك معلومات الاتصال الخاصة بك والروابط وملفات التعريف الاجتماعية بسهولة من خلال واجهة أنيقة وتفاعلية، متاحة في أي وقت وفي أي مكان.",
  "A compact, phone-backed digital business card designed for any professional. Instantly share your contact info, social links, or business profile,no apps, no paper, just seamless connection.": "بطاقة عمل رقمية مدمجة مدعومة بالهاتف مصممة لأي محترف. شارك معلومات الاتصال الخاصة بك، الروابط الاجتماعية، أو ملف التعريف التجاري فوراً، بدون تطبيقات، بدون ورق، فقط اتصال سلس.",
  "Products": "المنتجات",
  "Proceed to Payment": "المتابعة إلى الدفع",
  "Total Amount": "المبلغ الإجمالي",
  "Services": "الخدمات",
  "Branding": "العلامة التجارية",
  "Printing and related work": "الطباعة والأعمال ذات الصلة",
  "Web Designing": "تصميم الويب",
  "Select Time Slot": "اختر فترة زمنية",
  "Make An Appointment": "حدد موعدًا",
  "Date": "التاريخ",
  "Testimonials": "الشهادات",
  "Amanuel S.": "أمانويل س.",
  "S.E.E.D has built an efficient, user-friendly, and reliable website that helped us build a digital brand and enhance our visibility.": "قامت S.E.E.D ببناء موقع إلكتروني فعال وسهل الاستخدام وموثوق ساعدنا على بناء علامة تجارية رقمية وتعزيز ظهورنا.",
  "They listened carefully to our needs and delivered beyond expectations with their innovative approach to design and functionality.": "استمعوا بعناية لاحتياجاتنا وقدموا أكثر مما توقعنا من خلال نهجهم الابتكاري في التصميم والوظائف.",
  "Hanna T.": "هنا ت.",
  "Share Using QR Code": "المشاركة باستخدام رمز الاستجابة السريعة",
  "Share My QR Code": "مشاركة رمز الاستجابة السريعة الخاص بي",
  "Payment": "الدفع",
  "Choose your payment method": "اختر طريقة الدفع الخاصة بك",
  "TeleBirr": "تيلي بير",
  "CBE Birr": "بنك التجارة الإثيوبي بير",
  "Abyssinia": "أبيسينا",
  "Awash": "أواش",
  "Bank Number": "رقم البنك",
  "Copied": "تم النسخ",
  "Powered by": "تم الإنشاء بواسطة",
  "Our Partners": "شركاؤنا",
  "Get Notified": "احصل على إشعار",
  "Share": "مشاركة",
  "Register": "تسجيل",
  "Add to Contacts": "أضف إلى جهات الاتصال",
  "copyright": "© 2025 | مدعوم من S.E.E.D"
}


