
{
  "Alazare Shiferaw": "Alazare Shiferaw",
  "General Manager": "Bulchaa Waliigalaa",
  "Mobile Number": "Lakkoofsa Bilbila",
  "Email": "Imeelii",
  "We aim to lead East Africa in tech-driven engineering and education": "Teknooloojii irratti hundaa’uun Injiineriingii fi Barnoota Bahaa Afriikaa keessatti hoggansa gochuuf karoorfannee jirra",
  "Custom Card": "Kaardii Addaa",
  "Custom Phone Card": "Kaardii Bilbila Addaa",
  "A modern and professional digital business card designed to make a lasting impression. Easily share your contact info, links, and social profiles with a sleek, interactive interface, accessible anytime, anywhere.": "Kaardii daldalaa dijitaalaa ammayyaa fi ogummaa qabu kan yaada jabaa uumuuf qophaa’e. Odeeffannoo qunnamtii, links fi profilewwan hawaasummaa siif salphaa ta’een qoodadhu, yeroo kamiyyuu, iddoo kamiyyuu fayyadamuu dandeessu.",
  "A compact, phone-backed digital business card designed for any professional. Instantly share your contact info, social links, or business profile,no apps, no paper, just seamless connection.": "Kaardii daldalaa dijitaalaa bilbila irratti hunda’e, nama ogummaa qabuuf qophaa’e. Odeeffannoo qunnamtii, links hawaasummaa, yookiin profile daldalaa siif dafee qoodadhu, app ykn waraqaan hin barbaachisu, walqunnamtii tasgabbaa’aa qofa.",
  "Products": "Odeeffannoo",
  "Proceed to Payment": "Galii kaffaltii itti fufi",
  "Total Amount": "Waliigala Maallaqa",
  "Services": "Tajaajilawwan",
  "Branding": "Mallattoo Uumuu",
  "Printing and related work": "Maxxansaa fi Hojii Waliin Walqabatu",
  "Web Designing": "Qopheessuu Marsariitii",
  "Select Time Slot": "Sa’aatii Filadhu",
  "Make An Appointment": "Waa’ee Walgahii Murteessi",
  "Date": "Guyyaa",
  "Testimonials": "Dubbii Ragaa",
  "Amanuel S.": "Amanuel S.",
  "S.E.E.D has built an efficient, user-friendly, and reliable website that helped us build a digital brand and enhance our visibility.": "S.E.E.D marsariitii hojiirra oolu, namaaf salphaa fi amanamaa ta’e uume, kan nu gargaarte mallattoo dijitaalaa ijaaruufi mul’ata keenya cimsuuf.",
  "They listened carefully to our needs and delivered beyond expectations with their innovative approach to design and functionality.": "Fedhii keenya sirriitti dhaggeeffatan, tooftaalee haaraa fi hojiirra oolmaa isaanii wajjin waan olitti eeggan nuuf dhiyeessan.",
  "Hanna T.": "Hanna T.",
  "Share Using QR Code": "Koodii QR fayyadamuun qoodadhu",
  "Share My QR Code": "Koodii QR koo qoodadhu",
  "Payment": "Kaffaltii",
  "Choose your payment method": "Mala kaffaltii kee filadhu",
  "TeleBirr": "TeleBirr",
  "CBE Birr": "Baankii CBE Birr",
  "Abyssinia": "Abxinniyaa",
  "Awash": "Awash",
  "Bank Number": "Lakkoofsa Baankii",
  "Copied": "Kan maxxanfame",
  "Powered by": "Kan hojjetame",
  "Our Partners": "Hirmaatota Keenya",
  "Get Notified": "Beeksisa argadhu",
  "Share": "Qoodadhu",
  "Register": "Galmeessi",
  "Add to Contacts": "Qunnamtii keessa galchi",
  "copyright": "© 2025 | Kan S.E.E.D dhaan deeggarame"
}

